In [1]:
import pandas as pd
df6 = pd.read_csv("https://datasets.imdbws.com/title.principals.tsv.gz", sep = "\t", nrows=1000)
df6.head(10)

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Self""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0005690,producer,producer,\N
3,tt0000001,4,nm0374658,cinematographer,director of photography,\N
4,tt0000002,1,nm0721526,director,\N,\N
5,tt0000002,2,nm1335271,composer,\N,\N
6,tt0000003,1,nm0721526,director,\N,\N
7,tt0000003,2,nm1770680,producer,producer,\N
8,tt0000003,3,nm0721526,producer,producer,\N
9,tt0000003,4,nm1335271,composer,\N,\N

In [2]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   tconst      1000 non-null   object
 1   ordering    1000 non-null   int64
 2   nconst      1000 non-null   object
 3   category    1000 non-null   object
 4   job         1000 non-null   object
 5   characters  1000 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.0+ KB

In [3]:
df6.shape

(1000, 6)

In [4]:
df6.dtypes

tconst        object
ordering       int64
nconst        object
category      object
job           object
characters    object
dtype: object

In [5]:
df6.describe()

          ordering
count  1000.000000
mean      2.601000
std       2.623105
min       1.000000
25%       1.000000
50%       2.000000
75%       3.000000
max      19.000000